# ==================================================== Реалізація багатопоточності будьякої функції.=========================================

from threading import Thread

def worker(arg): # Будьяка функція яка примає якийсь аргумент і принтить його значення.
    print(arg) 


if __name__ == "__main__" :
    for i in range(5): # Цикл в якому формуємо 5 потоків нашої функції *worker(arg)
        th= Thread(target=worker,args=(f"Count_{i}",)) # th -зміна якій присвоюємо екземпляр вбудованого класу потчності *Thread() -з відповідними прапорцями.
                                                    # Де *target=*імя_функції_яку_розбиваємо_на_потоки, *args=(*кортеж_аргументів)- аргументи які передаєм в нашу функцію *worker(arg) - оскільки ми оголосили що функція пиймає аргументи 
                                                    # Примітка : *args= ("Якесь значення аргументу,може бути f-стрічка", )- аргменти завжди передаються кортежем , якщо потрібно передати тільки один аргумент то післянього ставимо кому і закриваємо дужку *)- тобто вказуємо на кінець кортежу.
        th.start() # Запускаємо потік.